

// Это я для себя шпаргалки написала))
// for(let a=+prompt('Введите число до 10'); a < 50; a++)
// {document.write(`Число ${a} <br>`); }

let age = prompt('Сколько тебе лет?', 100);
alert(`Тебе ${age} лет!`); // Тебе 100 лет!

let isBoss = confirm("Ты здесь главный?");
alert( isBoss ); // true, если нажата OK

вывести какой-то элемент массива на экран
let arr=[2,5,'ddd'];
document.write(arr[2]);

let arr=[[2,5,'ddd'],['r',333,'dfggf',true],['asdf',765,654,'fals',NaN]] ;
document.write(arr[2]);

let me=[['julia','designer','wife','mother'],[3,4,8,-444,6],['sdc 4','sdfv',777]];
document.write(me[0][2])

let arr=[2,5,'ddd','kola','fals','asdfvb'];
arr[80]='eeee';
document.write(arr[3],arr[0]+'<br>',arr[80]);

тут почему-то не работает последняя строка
let arr=[[2,5,'ddd'],['r',333,'dfggf',true],['asdf',765,654,'fals',NaN]] ;
for (const innerArray of arr){console.log(innerArray)};
for (const element of innerArray){console.log(element)};

тут не получается массив в массиве
let arr=[[2,5,'ddd'],['r',333,'dfggf',true],['asdf',765,654,'fals',NaN]] ;
for (let a=0;a<arr.length;a++){const innerArray=arr[a]};
for (let b=0;b<innerArray.length;b++) {let element=arr[b]};
console.log(element);

let names=['Alla','Ola','Vova','Kola'];
for (let name of names){
    document.write(name+'<br>')
};

let names=['Alla','Ola','Vova','Kola'];
for (let name in names){
    document.write(name+'<br>')
};

let all={
   names: ['Alla','Ola','Vova','Kola'], age:36, work:'designer'}
for (let key in all){
    document.write(key+'<br>')
};

let all={
    names: ['Alla','Ola','Vova','Kola'], age:36, work:'designer'}
 for (let key in all){
     document.write(all[key]+'<br>')
 };





// --створити масив та вивести його в консоль:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// ______________________________________________________________
// let arr=[4,-222,6.555,0,333];
// console.log(arr);
// let arr1=['Jimmi','Grey','Vova','Kate','Simon'];
// console.log(arr1);
// let arr2=[455,'Anna','Olga',true,false];
// console.log(arr2)

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// ______________________________________________________________
// let arr=[];
// arr[0]=333; arr[1]='Olga'; arr[2]=true; arr[3]='Anna'; arr[4]=-17;
// console.log(arr);

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// ______________________________________________________________
// for (let i = 0; i < 10; i++) {
// document.write(`<div> Индекс </div>`);}

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// ______________________________________________________________
// for (let i = 0; i < 10; i++) {
// document.write(`<div> Индекс - ${i}</div>`);}


// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// ______________________________________________________________
// let i=0;
// while (i<20){
// document.write(`<h1> Привет! </h1>`);i++}

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// ______________________________________________________________
// let i=0;
// while (i<20){
// document.write(`<h1> Привет!${i} </h1>`);i++}

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// ______________________________________________________________
// let arr=[1,15,2,-3,-5,0,333,87654,-654,1.15];
// for (let i=0; i<arr.length;i++){
//     document.write(`${arr[i]}<br>`)
// }


// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// ______________________________________________________________
// let arr=['Daddy','Vitko','Eva','Wow','Olga i Anna','Ho-ho-ho!','Dasha','Mom','Auch','Hi!'];
// for (let i=0; i<arr.length;i++){
//     document.write(`${arr[i]}<br>`)
// }

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// ______________________________________________________________
// let arr=[!true,15,'Eva',-3,'Olga i Anna',0,333,'Dasha',true,1.15];
// for (let i=0; i<arr.length;i++){
//     document.write(`${arr[i]}<br>`)
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// ______________________________________________________________
// let arr=[!true,15,'Eva','null','Olga i Anna',0,333,!true,true,1.15];
// for (let i=0; i<arr.length;i++){if (typeof arr[i] == 'boolean')
// {document.write(`${arr[i]}<br>`)}}


// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// ______________________________________________________________
// let arr=[!true,15,'Eva','null','Olga i Anna',0,333,!true,true,1.15];
// for (let i=0; i<arr.length;i++){if (typeof arr[i] == 'number')
// {document.write(`${arr[i]}<br>`)}}


// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// ______________________________________________________________
// let arr=[!true,15,'Eva','null','Olga i Anna',0,333,!true,true,1.15];
// for (let i=0; i<arr.length;i++){if (typeof arr[i] == 'string')
// {document.write(`${arr[i]}<br>`)}}


// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. 
// Вивести в консоль всі його елементи в циклі.
// ______________________________________________________________
// let arr=[];
// arr[0]=333; arr[1]='Olga'; arr[2]=true; arr[3]='Anna'; arr[4]=-17;
// for (let i=0; i<arr.length;i++){
//     console.log(`${arr[i]}`)}

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// ______________________________________________________________
// for (let i=0;i<10;i++){console.log(i);document.write(i);}

// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// ______________________________________________________________
// for (let i=0;i<100;i++){console.log(i);document.write(i);}

// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// ______________________________________________________________
// for (let i=0;i<100;i+=2){console.log(i);document.write(i);}

// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// ______________________________________________________________
// for (let i=1;i<101;i+=1){
// if (i%2==0){console.log(i);document.write(i);}}

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// ______________________________________________________________
// for (let i=1;i<101;i+=1){
//     if (i%2==1){console.log(i);document.write(i);}}


// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// ______________________________________________________________
// первый способ:
// for (let min=0;min<2;min++){for(let sec=0;sec<60;sec++){document.write(`Отсчитано ${min} мин и ${sec} сек <br>`)}};
// document.write(`Отсчитано 2 мин и 0 сек <br>`)

// ______________________________________________________________
// второй способ:
// for (let sec=0;sec<121;sec++){document.write(`${Math.trunc(sec/60)} мин и ${sec-(Math.trunc(sec/60))*60} сек <br>`)}


// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// ______________________________________________________________
// первый способ:
// for (let hour=0;hour<3;hour++){for(let min=0;min<60;min++)
//     {if(hour===2 && min===20){break}
//     {for(let sec=0;sec<60;sec++)
//     {document.write(`Отсчитано ${hour} ч ${min} мин и ${sec} сек <br>`)}}}};

 // ______________________________________________________________
// второй способ:
// time='0:0:0'
// for (let hour=0;hour<3;hour++){for(let min=0;min<60;min++){for(let sec=0;sec<60;sec++){
//     if (time=='2:20:0'){break}
//     time=`${hour}:${min}:${sec}`;
//     console.log(time)
// }}}


Додатково
- Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
- Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
- Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
- Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.

=================
=================
=================
=================

- Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
- Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
- Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
- Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
- Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
- Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
- Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
- Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
- Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
- Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
- Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
- Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
- Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
- Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.


============

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while
// ______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// i=0;
// while(i<arr.length){console.log(arr[i]);i++}


// 2. перебрати його циклом for
// ______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// for(let i=0;i<arr.length;i++){console.log(arr[i])}

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// ______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// i=0;
// while(i<arr.length){if (arr[i]%2==1){console.log(arr[i])};i++}

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// ______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// for (let i=0;i<arr.length;i++){if (arr[i]%2==1){console.log(arr[i])}}


// 5. перебрати циклом while та вивести  числа тільки парні  значення
// ______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// i=0;
// while(i<arr.length){if (arr[i]%2==0){console.log(arr[i])};i++}

// 6. перебрати циклом for та вивести  числа тільки парні  значення
// ______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// for (let i=0;i<arr.length;i++){if (arr[i]%2==0){console.log(arr[i])}}

// 7. замінити кожне число кратне 3 на слово "okten"
// ______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// for (let i=0;i<arr.length;i++){if (arr[i]%3==0){arr[i]='okten'} console.log(arr[i])}


// 8. вивести масив в зворотньому порядку.
// ______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse();
// console.log(arr)


// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 1______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse()
// i=0;
// while(i<arr.length){console.log(arr[i]);i++}

// 2______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse()
// for(let i=0;i<arr.length;i++){console.log(arr[i])}

// 3______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse();
// i=0;
// while(i<arr.length){if (arr[i]%2==1){console.log(arr[i])};i++}

// 4______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse();
// for (let i=0;i<arr.length;i++){if (arr[i]%2==1){console.log(arr[i])}}

// 5______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse();
// i=0;
// while(i<arr.length){if (arr[i]%2==0){console.log(arr[i])};i++}

// 6______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse();
// for (let i=0;i<arr.length;i++){if (arr[i]%2==0){console.log(arr[i])}}

// 7______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse();
// for (let i=0;i<arr.length;i++){if (arr[i]%3==0){arr[i]='okten'} console.log(arr[i])}


// 10 !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//  створити пустий масив та 
//  - заповнити його 50 парними числами за допомоги циклу.
// _______________________________________________________
//  let arr=[];
// for (let i=1;i<101;i++){if (i%2===0){arr.push(i)}};
// console.log(arr)

//  створити пустий масив та 
// - заповнити його 50 непарними числами за допомоги циклу.
// let arr=[];
// for (let i=1;i<101;i++){if (i%2===1){arr.push(i)}};
// console.log(arr)
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!


3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
_______________________________________________________
let arr = [];
let i = 1;
while (arr.length<20) {arr.push(i);i = Math.floor(Math.random()*20)+1};
console.log(arr)


 диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
_______________________________________________________
 let arr = [];
 let i = 8;
 while (arr.length<20) {arr.push(i);i = Math.floor(Math.random()*732)+8};
 console.log(arr)

 2. вывести на консоль  каждый третий елемент
 _______________________________________________________
 let arr = [];
 let i = 8;
 while (arr.length<20) {arr.push(i);i = Math.floor(Math.random()*732)+8};
 console.log(arr);
 for (i=1;i<arr.length;i++){if (i%3===0){console.log(arr[i])}}


 3. вывести на консоль  каждый третий елемент
 но при условии что его значение является парным.
 _______________________________________________________
 let arr = [];
 let i = 8;
 while (arr.length<20) {arr.push(i);i = Math.floor(Math.random()*732)+8};
 console.log(arr);
 for (i=1;i<arr.length;i++){if (i%3===0 && arr[i]%2===0){console.log(arr[i])}}


 4. вывести на консоль  каждый третий елемент
 но при условии что он имеет парное значение и
 записать их в другой массив.
 _______________________________________________________
 let arr = [];
 let arr2=[];
 let i = 8;
 while (arr.length<20) {arr.push(i);i = Math.floor(Math.random()*732)+8};
 console.log(arr);
 for (i=1;i<arr.length;i++){if (i%3===0 && arr[i]%2===0){console.log(arr[i]);arr2.push(arr[i])}};
 console.log(arr2);


 5. Вывести каждый елемент массива у которого соседний с права элемент - парный

 
  5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.

3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
 додати його в інший масив.



