
// --створити масив та вивести його в консоль:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// ______________________________________________________________
// let arr=[4,-222,6.555,0,333];
// console.log(arr);
// let arr1=['Jimmi','Grey','Vova','Kate','Simon'];
// console.log(arr1);
// let arr2=[455,'Anna','Olga',true,false];
// console.log(arr2)

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// ______________________________________________________________
// let arr=[];
// arr[0]=333; arr[1]='Olga'; arr[2]=true; arr[3]='Anna'; arr[4]=-17;
// console.log(arr);

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// ______________________________________________________________
// for (let i = 0; i < 10; i++) {
// document.write(`<div> Индекс </div>`);}

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// ______________________________________________________________
// for (let i = 0; i < 10; i++) {
// document.write(`<div> Индекс - ${i}</div>`);}


// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// ______________________________________________________________
// let i=0;
// while (i<20){
// document.write(`<h1> Привет! </h1>`);i++}

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// ______________________________________________________________
// let i=0;
// while (i<20){
// document.write(`<h1> Привет!${i} </h1>`);i++}

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// ______________________________________________________________
// let arr=[1,15,2,-3,-5,0,333,87654,-654,1.15];
// for (let i=0; i<arr.length;i++){
//     document.write(`${arr[i]}<br>`)
// }


// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// ______________________________________________________________
// let arr=['Daddy','Vitko','Eva','Wow','Olga i Anna','Ho-ho-ho!','Dasha','Mom','Auch','Hi!'];
// for (let i=0; i<arr.length;i++){
//     document.write(`${arr[i]}<br>`)
// }

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// ______________________________________________________________
// let arr=[!true,15,'Eva',-3,'Olga i Anna',0,333,'Dasha',true,1.15];
// for (let i=0; i<arr.length;i++){
//     document.write(`${arr[i]}<br>`)
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// ______________________________________________________________
// let arr=[!true,15,'Eva','null','Olga i Anna',0,333,!true,true,1.15];
// for (let i=0; i<arr.length;i++){if (typeof arr[i] == 'boolean')
// {document.write(`${arr[i]}<br>`)}}


// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// ______________________________________________________________
// let arr=[!true,15,'Eva','null','Olga i Anna',0,333,!true,true,1.15];
// for (let i=0; i<arr.length;i++){if (typeof arr[i] == 'number')
// {document.write(`${arr[i]}<br>`)}}


// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// ______________________________________________________________
// let arr=[!true,15,'Eva','null','Olga i Anna',0,333,!true,true,1.15];
// for (let i=0; i<arr.length;i++){if (typeof arr[i] == 'string')
// {document.write(`${arr[i]}<br>`)}}


// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. 
// Вивести в консоль всі його елементи в циклі.
// ______________________________________________________________
// let arr=[];
// arr[0]=333; arr[1]='Olga'; arr[2]=true; arr[3]='Anna'; arr[4]=-17;
// for (let i=0; i<arr.length;i++){
//     console.log(`${arr[i]}`)}

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// ______________________________________________________________
// for (let i=0;i<10;i++){console.log(i);document.write(i);}

// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// ______________________________________________________________
// for (let i=0;i<100;i++){console.log(i);document.write(i);}

// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// ______________________________________________________________
// for (let i=0;i<100;i+=2){console.log(i);document.write(i);}

// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// ______________________________________________________________
// for (let i=1;i<101;i+=1){
// if (i%2==0){console.log(i);document.write(i);}}

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// ______________________________________________________________
// for (let i=1;i<101;i+=1){
//     if (i%2==1){console.log(i);document.write(i);}}


// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// ______________________________________________________________
// первый способ:
// for (let min=0;min<2;min++){for(let sec=0;sec<60;sec++){document.write(`Отсчитано ${min} мин и ${sec} сек <br>`)}};
// document.write(`Отсчитано 2 мин и 0 сек <br>`)

// ______________________________________________________________
// второй способ:
// for (let sec=0;sec<121;sec++){document.write(`${Math.trunc(sec/60)} мин и ${sec-(Math.trunc(sec/60))*60} сек <br>`)}


// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// ______________________________________________________________
// первый способ:
// for (let hour=0;hour<3;hour++){for(let min=0;min<60;min++)
//     {if(hour===2 && min===20){break}
//     {for(let sec=0;sec<60;sec++)
//     {document.write(`Отсчитано ${hour} ч ${min} мин и ${sec} сек <br>`)}}}};

 // ______________________________________________________________
// второй способ:
// time='0:0:0'
// for (let hour=0;hour<3;hour++){for(let min=0;min<60;min++){for(let sec=0;sec<60;sec++){
//     if (time=='2:20:0'){break}
//     time=`${hour}:${min}:${sec}`;
//     console.log(time)
// }}}

============

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while
// ______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// i=0;
// while(i<arr.length){console.log(arr[i]);i++}


// 2. перебрати його циклом for
// ______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// for(let i=0;i<arr.length;i++){console.log(arr[i])}

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// ______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// i=0;
// while(i<arr.length){if (arr[i]%2==1){console.log(arr[i])};i++}

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// ______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// for (let i=0;i<arr.length;i++){if (arr[i]%2==1){console.log(arr[i])}}


// 5. перебрати циклом while та вивести  числа тільки парні  значення
// ______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// i=0;
// while(i<arr.length){if (arr[i]%2==0){console.log(arr[i])};i++}

// 6. перебрати циклом for та вивести  числа тільки парні  значення
// ______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// for (let i=0;i<arr.length;i++){if (arr[i]%2==0){console.log(arr[i])}}

// 7. замінити кожне число кратне 3 на слово "okten"
// ______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// for (let i=0;i<arr.length;i++){if (arr[i]%3==0){arr[i]='okten'} console.log(arr[i])}


// 8. вивести масив в зворотньому порядку.
// ______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse();
// console.log(arr)


// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 1______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse()
// i=0;
// while(i<arr.length){console.log(arr[i]);i++}

// 2______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse()
// for(let i=0;i<arr.length;i++){console.log(arr[i])}

// 3______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse();
// i=0;
// while(i<arr.length){if (arr[i]%2==1){console.log(arr[i])};i++}

// 4______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse();
// for (let i=0;i<arr.length;i++){if (arr[i]%2==1){console.log(arr[i])}}

// 5______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse();
// i=0;
// while(i<arr.length){if (arr[i]%2==0){console.log(arr[i])};i++}

// 6______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse();
// for (let i=0;i<arr.length;i++){if (arr[i]%2==0){console.log(arr[i])}}

// 7______________________________________________________________
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse();
// for (let i=0;i<arr.length;i++){if (arr[i]%3==0){arr[i]='okten'} console.log(arr[i])}


// 10 !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//  створити пустий масив та 
//  - заповнити його 50 парними числами за допомоги циклу.
// _______________________________________________________
//  let arr=[];
// for (let i=1;i<101;i++){if (i%2===0){arr.push(i)}};
// console.log(arr)

//  створити пустий масив та 
// - заповнити його 50 непарними числами за допомоги циклу.
// let arr=[];
// for (let i=1;i<101;i++){if (i%2===1){arr.push(i)}};
// console.log(arr)
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!


// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
// _______________________________________________________
// let arr = [];
// let i = 1;
// while (arr.length<20) {arr.push(i);i = Math.floor(Math.random()*20)+1};
// console.log(arr)


//  диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
// _______________________________________________________
//  let arr = [];
//  let i = 8;
//  while (arr.length<20) {arr.push(i);i = Math.floor(Math.random()*732)+8};
//  console.log(arr)

//  2. вывести на консоль  каждый третий елемент
//  _______________________________________________________
//  let arr = [];
//  let i = 8;
//  while (arr.length<20) {arr.push(i);i = Math.floor(Math.random()*732)+8};
//  console.log(arr);
//  for (i=1;i<arr.length;i++){if (i%3===0){console.log(arr[i])}}


//  3. вывести на консоль  каждый третий елемент
//  но при условии что его значение является парным.
//  _______________________________________________________
//  let arr = [];
//  let i = 8;
//  while (arr.length<20) {arr.push(i);i = Math.floor(Math.random()*732)+8};
//  console.log(arr);
//  for (i=1;i<arr.length;i++){if (i%3===0 && arr[i]%2===0){console.log(arr[i])}}


//  4. вывести на консоль  каждый третий елемент
//  но при условии что он имеет парное значение и
//  записать их в другой массив.
//  _______________________________________________________
//  let arr = [];
//  let arr2=[];
//  let i = 8;
//  while (arr.length<20) {arr.push(i);i = Math.floor(Math.random()*732)+8};
//  console.log(arr);
//  for (i=1;i<arr.length;i++){if (i%3===0 && arr[i]%2===0){console.log(arr[i]);arr2.push(arr[i])}};
//  console.log(arr2);

